StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE8/MDR_RST_VE8_defs.h
#ifndef _MDR_RST_VE8_DEFS_H
#define _MDR_RST_VE8_DEFS_H

#ifdef __cplusplus
extern "C" {
#endif


#include <MDR_RST_VE8x_defs.h>


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif
/* ========================================  Start of section using anonymous unions  ======================================== */

/* =====================================================  CLOCK_STATUS  ====================================================== */

//---------------   PER Clock  ---------------
typedef struct {
      __IM  uint32_t                  : 13;
      __IOM MDR_OnOff   PortA_CLK_EN  : 1;          /*!< [13..13] GPIO Port Clock Enable                                           */
      __IOM MDR_OnOff   PortB_CLK_EN  : 1;          /*!< [14..14] GPIO Port Clock Enable                                           */
      __IOM MDR_OnOff   PortC_CLK_EN  : 1;          /*!< [15..15] GPIO Port Clock Enable                                           */
      __IOM MDR_OnOff   PortD_CLK_EN  : 1;          /*!< [16..16] GPIO Port Clock Enable                                           */
      __IOM MDR_OnOff   PortE_CLK_EN  : 1;          /*!< [17..17] GPIO Port Clock Enable                                           */
      __IM  uint32_t                  : 3;
      __IOM MDR_OnOff   SPW1_CLK_EN   : 1;           /*!< [21..21] SPW1 Clock Enable                                                */
      __IM  uint32_t                  : 1;
      __IOM MDR_OnOff   TIM1_CLK_EN   : 1;           /*!< [23..23] TIM1 Clock Enable                                                */
      __IOM MDR_OnOff   TIM2_CLK_EN   : 1;           /*!< [24..24] TIM2 Clock Enable                                                */
      __IOM MDR_OnOff   TIM3_CLK_EN   : 1;           /*!< [25..25] TIM3 Clock Enable                                                */
      __IOM MDR_OnOff   TIM4_CLK_EN   : 1;           /*!< [26..26] TIM4 Clock Enable                                                */
      __IM  uint32_t                  : 2;
      __IOM MDR_OnOff   CAN1_CLK_EN   : 1;           /*!< [29..29] CAN1 Clock Enable                                                */
      __IM  uint32_t                  : 2;
} MDR_RST_PER0_Bits;

#define MDR_RST_PER0_PORTA_CLK_EN_Pos (13UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortA_CLK_EN (Bit 13)         */
#define MDR_RST_PER0_PORTA_CLK_EN_Msk (0x2000UL)          /*!< MDR_RST_CLOCK PER0_CLK: PortA_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_PORTB_CLK_EN_Pos (14UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortB_CLK_EN (Bit 14)         */
#define MDR_RST_PER0_PORTB_CLK_EN_Msk (0x4000UL)          /*!< MDR_RST_CLOCK PER0_CLK: PortB_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_PORTC_CLK_EN_Pos (15UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortC_CLK_EN (Bit 15)         */
#define MDR_RST_PER0_PORTC_CLK_EN_Msk (0x8000UL)          /*!< MDR_RST_CLOCK PER0_CLK: PortC_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_PORTD_CLK_EN_Pos (16UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortD_CLK_EN (Bit 16)         */
#define MDR_RST_PER0_PORTD_CLK_EN_Msk (0x10000UL)         /*!< MDR_RST_CLOCK PER0_CLK: PortD_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_PORTE_CLK_EN_Pos (17UL)              /*!< MDR_RST_CLOCK PER0_CLK: PortE_CLK_EN (Bit 17)         */
#define MDR_RST_PER0_PORTE_CLK_EN_Msk (0x20000UL)         /*!< MDR_RST_CLOCK PER0_CLK: PortE_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_SPW1_CLK_EN_Pos (21UL)               /*!< MDR_RST_CLOCK PER0_CLK: SPW1_CLK_EN (Bit 21)          */
#define MDR_RST_PER0_SPW1_CLK_EN_Msk (0x200000UL)         /*!< MDR_RST_CLOCK PER0_CLK: SPW1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_TIM1_CLK_EN_Pos (23UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM1_CLK_EN (Bit 23)          */
#define MDR_RST_PER0_TIM1_CLK_EN_Msk (0x800000UL)         /*!< MDR_RST_CLOCK PER0_CLK: TIM1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_TIM2_CLK_EN_Pos (24UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM2_CLK_EN (Bit 24)          */
#define MDR_RST_PER0_TIM2_CLK_EN_Msk (0x1000000UL)        /*!< MDR_RST_CLOCK PER0_CLK: TIM2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_TIM3_CLK_EN_Pos (25UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM3_CLK_EN (Bit 25)          */
#define MDR_RST_PER0_TIM3_CLK_EN_Msk (0x2000000UL)        /*!< MDR_RST_CLOCK PER0_CLK: TIM3_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_TIM4_CLK_EN_Pos (26UL)               /*!< MDR_RST_CLOCK PER0_CLK: TIM4_CLK_EN (Bit 26)          */
#define MDR_RST_PER0_TIM4_CLK_EN_Msk (0x4000000UL)        /*!< MDR_RST_CLOCK PER0_CLK: TIM4_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER0_CAN1_CLK_EN_Pos (29UL)               /*!< MDR_RST_CLOCK PER0_CLK: CAN1_CLK_EN (Bit 29)          */
#define MDR_RST_PER0_CAN1_CLK_EN_Msk (0x20000000UL)       /*!< MDR_RST_CLOCK PER0_CLK: CAN1_CLK_EN (Bitfield-Mask: 0x01) */


typedef struct {
      __IM  uint32_t                    : 2;
      __IOM MDR_OnOff   SSP1_CLK_EN     : 1;         /*!< [2..2] SSP1 Clock Enable                                                  */
      __IM  uint32_t                    : 3;
      __IOM MDR_OnOff   UART1_CLK_EN    : 1;         /*!< [6..6] UART1 Clock Enable                                                 */
      __IOM MDR_OnOff   UART2_CLK_EN    : 1;         /*!< [7..7] UART2 Clock Enable                                                 */
      __IM  uint32_t                    : 3;
      __IOM MDR_OnOff   ARINK_RX_CLK_EN : 1;         /*!< [11..11] ARINK_RX Clock Enable                                            */
      __IM  uint32_t                    : 1;
      __IOM MDR_OnOff   ARINK_TX_CLK_EN : 1;         /*!< [13..13] ARINK_TX Clock Enable                                            */
      __IM  uint32_t                    : 5;
      __IOM MDR_OnOff   MIL1_CLK_EN     : 1;         /*!< [19..19] MIL1 Clock Enable                                                */
      __IM  uint32_t                    : 1;
      __IOM MDR_OnOff   MIL2_CLK_EN     : 1;         /*!< [21..21] MIL2 Clock Enable                                                */
      __IM  uint32_t                    : 1;
      __IOM MDR_OnOff   ADC1_CLK_EN     : 1;         /*!< [23..23] ADC1 Clock Enable                                                */
      __IOM MDR_OnOff   ADC2_CLK_EN     : 1;         /*!< [24..24] ADC2 Clock Enable                                                */
      __IOM MDR_OnOff   DAC1_CLK_EN     : 1;         /*!< [25..25] DAC1 Clock Enable                                                */
      __IOM MDR_OnOff   DAC2_CLK_EN     : 1;         /*!< [26..26] DAC2 Clock Enable                                                */
      __IM  uint32_t                    : 5;
} MDR_RST_PER1_Bits;

#define MDR_RST_PER1_SSP1_CLK_EN_Pos (2UL)                /*!< MDR_RST_CLOCK PER1_CLK: SSP1_CLK_EN (Bit 2)           */
#define MDR_RST_PER1_SSP1_CLK_EN_Msk (0x4UL)              /*!< MDR_RST_CLOCK PER1_CLK: SSP1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_UART1_CLK_EN_Pos (6UL)               /*!< MDR_RST_CLOCK PER1_CLK: UART1_CLK_EN (Bit 6)          */
#define MDR_RST_PER1_UART1_CLK_EN_Msk (0x40UL)            /*!< MDR_RST_CLOCK PER1_CLK: UART1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_UART2_CLK_EN_Pos (7UL)               /*!< MDR_RST_CLOCK PER1_CLK: UART2_CLK_EN (Bit 7)          */
#define MDR_RST_PER1_UART2_CLK_EN_Msk (0x80UL)            /*!< MDR_RST_CLOCK PER1_CLK: UART2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_ARINK_RX_CLK_EN_Pos (11UL)           /*!< MDR_RST_CLOCK PER1_CLK: ARINK_RX_CLK_EN (Bit 11)      */
#define MDR_RST_PER1_ARINK_RX_CLK_EN_Msk (0x800UL)        /*!< MDR_RST_CLOCK PER1_CLK: ARINK_RX_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_ARINK_TX_CLK_EN_Pos (13UL)           /*!< MDR_RST_CLOCK PER1_CLK: ARINK_TX_CLK_EN (Bit 13)      */
#define MDR_RST_PER1_ARINK_TX_CLK_EN_Msk (0x2000UL)       /*!< MDR_RST_CLOCK PER1_CLK: ARINK_TX_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_MIL1_CLK_EN_Pos (19UL)               /*!< MDR_RST_CLOCK PER1_CLK: MIL1_CLK_EN (Bit 19)          */
#define MDR_RST_PER1_MIL1_CLK_EN_Msk (0x80000UL)          /*!< MDR_RST_CLOCK PER1_CLK: MIL1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_MIL2_CLK_EN_Pos (21UL)               /*!< MDR_RST_CLOCK PER1_CLK: MIL2_CLK_EN (Bit 21)          */
#define MDR_RST_PER1_MIL2_CLK_EN_Msk (0x200000UL)         /*!< MDR_RST_CLOCK PER1_CLK: MIL2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_ADC1_CLK_EN_Pos (23UL)               /*!< MDR_RST_CLOCK PER1_CLK: ADC1_CLK_EN (Bit 23)          */
#define MDR_RST_PER1_ADC1_CLK_EN_Msk (0x800000UL)         /*!< MDR_RST_CLOCK PER1_CLK: ADC1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_ADC2_CLK_EN_Pos (24UL)               /*!< MDR_RST_CLOCK PER1_CLK: ADC2_CLK_EN (Bit 24)          */
#define MDR_RST_PER1_ADC2_CLK_EN_Msk (0x1000000UL)        /*!< MDR_RST_CLOCK PER1_CLK: ADC2_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_DAC1_CLK_EN_Pos (25UL)               /*!< MDR_RST_CLOCK PER1_CLK: DAC1_CLK_EN (Bit 25)          */
#define MDR_RST_PER1_DAC1_CLK_EN_Msk (0x2000000UL)        /*!< MDR_RST_CLOCK PER1_CLK: DAC1_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_PER1_DAC2_CLK_EN_Pos (26UL)               /*!< MDR_RST_CLOCK PER1_CLK: DAC2_CLK_EN (Bit 26)          */
#define MDR_RST_PER1_DAC2_CLK_EN_Msk (0x4000000UL)        /*!< MDR_RST_CLOCK PER1_CLK: DAC2_CLK_EN (Bitfield-Mask: 0x01) */


//--------------- LSI/LSE/HSE0/HSE1/PLLx status Bits  ------------------
typedef struct {
      __IOM uint8_t   MAX_CLK_SHIFT_REG0 : 8;    /*!< [7..0] Max factor detected for SLOW                                              */
      __IOM uint8_t   MAX_CLK_SHIFT_REG1 : 8;    /*!< [15..8] Max factor detected for FAST                                             */
      __IOM MDR_OnOff EVENT0            : 1;            /*!< [16..16] Event SLOWEST                                                   */
      __IOM MDR_OnOff EVENT1            : 1;            /*!< [17..17] Event SLOW                                                      */
      __IOM MDR_OnOff EVENT2            : 1;            /*!< [18..18] Event FAST                                                      */
      __IOM MDR_OnOff EVENT3            : 1;            /*!< [19..19] Event FASTEST                                                   */
      __IOM MDR_OnOff READY             : 1;            /*!< [20..20] Clock Ready                                                     */
      __IM  uint32_t                    : 11;
} MDR_RST_CLK_STAT_Bits;

#define MDR_RST_CLK_STAT_MAX_CLK_SHIFT_REG0_Pos (0UL)         /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG0 (Bit 0)    */
#define MDR_RST_CLK_STAT_MAX_CLK_SHIFT_REG0_Msk (0xffUL)      /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG0 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLK_STAT_MAX_CLK_SHIFT_REG1_Pos (8UL)         /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG1 (Bit 8)    */
#define MDR_RST_CLK_STAT_MAX_CLK_SHIFT_REG1_Msk (0xff00UL)    /*!< MDR_RST_CLOCK CPU_STAT: MAX_CLK_SHIFT_REG1 (Bitfield-Mask: 0xff) */
#define MDR_RST_CLK_STAT_EVENT0_Pos (16UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT0 (Bit 16)               */
#define MDR_RST_CLK_STAT_EVENT0_Msk (0x10000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT0 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLK_STAT_EVENT1_Pos (17UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT1 (Bit 17)               */
#define MDR_RST_CLK_STAT_EVENT1_Msk (0x20000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT1 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLK_STAT_EVENT2_Pos (18UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT2 (Bit 18)               */
#define MDR_RST_CLK_STAT_EVENT2_Msk (0x40000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT2 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLK_STAT_EVENT3_Pos (19UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT3 (Bit 19)               */
#define MDR_RST_CLK_STAT_EVENT3_Msk (0x80000UL)               /*!< MDR_RST_CLOCK CPU_STAT: EVENT3 (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLK_STAT_READY_Pos  (20UL)                    /*!< MDR_RST_CLOCK CPU_STAT: EVENT3 (Bit 19)               */
#define MDR_RST_CLK_STAT_READY_Msk  (0x100000UL)              /*!< MDR_RST_CLOCK CPU_STAT: EVENT3 (Bitfield-Mask: 0x01)  */


//--------------- HSI Bits  ------------------  
typedef struct {
      __IM  uint32_t                : 20;
      __IOM MDR_OnOff   READY       : 1;            /*!< [20..20] Clock Ready                                                         */
      __IM  uint32_t                : 11;
} MDR_RST_HSI_STAT_Bits;

#define MDR_RST_HSI_STAT_READY_Pos  (20UL)                    /*!< MDR_RST_CLOCK HSE_STAT: READY (Bit 20)                */
#define MDR_RST_HSI_STAT_READY_Msk  (0x100000UL)              /*!< MDR_RST_CLOCK HSE_STAT: READY (Bitfield-Mask: 0x01)   */

//--------------- PLL Bits  ------------------  

typedef enum {                                  /*!< MDR_RST_CLOCK_PLL0_CLK_PLL_Q                                              */
  MDR_PLL_Q_div1    = 0,     /*!< div1 : Divider                                                            */
  MDR_PLL_Q_div2    = 1,     /*!< div2 : Divider                                                            */
  MDR_PLL_Q_div3    = 2,     /*!< div3 : Divider                                                            */
  MDR_PLL_Q_div4    = 3,     /*!< div4 : Divider                                                            */
  MDR_PLL_Q_div5    = 4,     /*!< div5 : Divider                                                            */
  MDR_PLL_Q_div6    = 5,     /*!< div6 : Divider                                                            */
  MDR_PLL_Q_div7    = 6,     /*!< div7 : Divider                                                            */
  MDR_PLL_Q_div8    = 7,     /*!< div8 : Divider                                                            */
  MDR_PLL_Q_div9    = 8,     /*!< div9 : Divider                                                            */
  MDR_PLL_Q_div10   = 9,     /*!< div10 : Divider                                                           */
  MDR_PLL_Q_div11   = 10,    /*!< div11 : Divider                                                           */
  MDR_PLL_Q_div12   = 11,    /*!< div12 : Divider                                                           */
  MDR_PLL_Q_div13   = 12,    /*!< div13 : Divider                                                           */
  MDR_PLL_Q_div14   = 13,    /*!< div14 : Divider                                                           */
  MDR_PLL_Q_div15   = 14,    /*!< div15 : Divider                                                           */
  MDR_PLL_Q_div16   = 15,    /*!< div16 : Divider                                                           */
} MDR_PLL_DivQ;

