StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE8/MDR_RST_VE8_defs.h
typedef enum {                /*!< MDR_RST_CLOCK_PLL0_CLK_SELECT                                             */
  MDR_PLL_IN_HSI       = 0,   /*!< HSI : HSI signal                                                          */
  MDR_PLL_IN_HSIdiv2   = 1,   /*!< HSI_div2 : HSI/2 signal                                                   */
  MDR_PLL_IN_HSE0      = 2,   /*!< HSE0 : HSE0 signal                                                        */
  MDR_PLL_IN_HSE0div2  = 3,   /*!< HSE0_div2 : HSE0/2 signal                                                 */
  MDR_PLL_IN_HSE1      = 4,   /*!< HSE1 : HSE1 signal                                                        */
  MDR_PLL_IN_HSE1div2  = 5,   /*!< HSE1_div2 : HSE1/2 signal                                                 */
} MDR_PLL_IN_SEL;

typedef struct {
      __IOM MDR_PLL_DivQ    PLL_Q               : 4;    /*!< [3..0] PLL Freq divider                                                   */
      __IOM MDR_OnOff       Div2                : 1;    /*!< [4..4] PLL Output Divider                                                 */
      __IM  uint32_t                            : 3;
      __IOM uint32_t        PLL_N               : 7;    /*!< [14..8] PLL Freq multiplier                                               */
      __IM  uint32_t                            : 1;
      __IOM MDR_OnOff       EN_CHK_EVENT0       : 1;    /*!< [16..16] Go to HSI on lose active clock                                   */
      __IOM MDR_OnOff       EN_CHK_EVENT1       : 1;    /*!< [17..17] Go to HSI if active clock is low                                 */
      __IOM MDR_OnOff       EN_CHK_EVENT2       : 1;    /*!< [18..18] Go to HSI if active clock is High                                */
      __IOM MDR_OnOff       EN_CHK_EVENT3       : 1;    /*!< [19..19] Go to HSI if active clock is Highest                             */
      __IOM MDR_OnOff       EN_CHK              : 1;    /*!< [20..20] Clock Checker enable                                             */
      __IOM MDR_OnOff       CLR_CHK_SHIFT_REG0  : 1;    /*!< [21..21] Clear Min Freq level                                             */
      __IOM MDR_OnOff       CLR_CHK_SHIFT_REG1  : 1;    /*!< [22..22] Clear Max Freq level                                             */
      __IOM MDR_OnOff       CLR_CHK_EVENT0      : 1;    /*!< [23..23] Clear no freq event                                              */
      __IOM MDR_OnOff       CLR_CHK_EVENT1      : 1;    /*!< [24..24] Clear low freq event                                             */
      __IOM MDR_OnOff       CLR_CHK_EVENT2      : 1;    /*!< [25..25] Clear high freq event                                            */
      __IOM MDR_OnOff       CLR_CHK_EVENT3      : 1;    /*!< [26..26] Clear highest freq event                                         */
      __IOM MDR_OnOff       PLL_ON              : 1;    /*!< [27..27] PLL Enable                                                       */
      __IOM MDR_OnOff       PLL_RLD             : 1;    /*!< [28..28] PLL Reload                                                       */
      __IOM MDR_PLL_IN_SEL  SELECT              : 3;    /*!< [31..29] Select PLL Input                                                 */
} MDR_RST_PLL_CLK_Bits;

#define MDR_RST_PLL_PLL_Q_Pos         (0UL)              /*!< MDR_RST_CLOCK PLL0_CLK: PLL_Q (Bit 0)                 */
#define MDR_RST_PLL_PLL_Q_Msk         (0xfUL)            /*!< MDR_RST_CLOCK PLL0_CLK: PLL_Q (Bitfield-Mask: 0x0f)   */
#define MDR_RST_PLL_DV_Pos            (4UL)              /*!< MDR_RST_CLOCK PLL0_CLK: DV (Bit 4)                    */
#define MDR_RST_PLL_DV_Msk            (0x10UL)           /*!< MDR_RST_CLOCK PLL0_CLK: DV (Bitfield-Mask: 0x01)      */
#define MDR_RST_PLL_PLL_N_Pos         (8UL)              /*!< MDR_RST_CLOCK PLL0_CLK: PLL_N (Bit 8)                 */
#define MDR_RST_PLL_PLL_N_Msk         (0x7f00UL)         /*!< MDR_RST_CLOCK PLL0_CLK: PLL_N (Bitfield-Mask: 0x7f)   */
#define MDR_RST_PLL_EN_CHK_EVENT0_Pos (16UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT0 (Bit 16)        */
#define MDR_RST_PLL_EN_CHK_EVENT0_Msk (0x10000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_EN_CHK_EVENT1_Pos (17UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT1 (Bit 17)        */
#define MDR_RST_PLL_EN_CHK_EVENT1_Msk (0x20000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_EN_CHK_EVENT2_Pos (18UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT2 (Bit 18)        */
#define MDR_RST_PLL_EN_CHK_EVENT2_Msk (0x40000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_EN_CHK_EVENT3_Pos (19UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT3 (Bit 19)        */
#define MDR_RST_PLL_EN_CHK_EVENT3_Msk (0x80000UL)        /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_EN_CHK_Pos        (20UL)             /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK (Bit 20)               */
#define MDR_RST_PLL_EN_CHK_Msk        (0x100000UL)       /*!< MDR_RST_CLOCK PLL0_CLK: EN_CHK (Bitfield-Mask: 0x01)  */
#define MDR_RST_PLL_CLR_CHK_SHIFT_REG0_Pos (21UL)        /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG0 (Bit 21)   */
#define MDR_RST_PLL_CLR_CHK_SHIFT_REG0_Msk (0x200000UL)  /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG0 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_CLR_CHK_SHIFT_REG1_Pos (22UL)        /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG1 (Bit 22)   */
#define MDR_RST_PLL_CLR_CHK_SHIFT_REG1_Msk (0x400000UL)  /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_SHIFT_REG1 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_CLR_CHK_EVENT0_Pos (23UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT0 (Bit 23)       */
#define MDR_RST_PLL_CLR_CHK_EVENT0_Msk (0x800000UL)      /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT0 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_CLR_CHK_EVENT1_Pos (24UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT1 (Bit 24)       */
#define MDR_RST_PLL_CLR_CHK_EVENT1_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT1 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_CLR_CHK_EVENT2_Pos (25UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT2 (Bit 25)       */
#define MDR_RST_PLL_CLR_CHK_EVENT2_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT2 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_CLR_CHK_EVENT3_Pos (26UL)            /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT3 (Bit 26)       */
#define MDR_RST_PLL_CLR_CHK_EVENT3_Msk (0x4000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: CLR_CHK_EVENT3 (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_PLL_ON_Pos        (27UL)             /*!< MDR_RST_CLOCK PLL0_CLK: PLL_ON (Bit 27)               */
#define MDR_RST_PLL_PLL_ON_Msk        (0x8000000UL)      /*!< MDR_RST_CLOCK PLL0_CLK: PLL_ON (Bitfield-Mask: 0x01)  */
#define MDR_RST_PLL_PLL_RLD_Pos       (28UL)             /*!< MDR_RST_CLOCK PLL0_CLK: PLL_RLD (Bit 28)              */
#define MDR_RST_PLL_PLL_RLD_Msk       (0x10000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: PLL_RLD (Bitfield-Mask: 0x01) */
#define MDR_RST_PLL_SELECT_Pos        (29UL)             /*!< MDR_RST_CLOCK PLL0_CLK: SELECT (Bit 29)               */
#define MDR_RST_PLL_SELECT_Msk        (0xe0000000UL)     /*!< MDR_RST_CLOCK PLL0_CLK: SELECT (Bitfield-Mask: 0x07)  */


/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40000000) MDR_RST_CLOCK Structure                                    */ 
  __IOM uint32_t KEY;                           /*!< (@ 0x00000000) Clock Unlock Register                                      */  
  union {
    __IOM uint32_t        MAX_CLK;              /*!< (@ 0x00000004) MAX_CLK Select Register                                    */
    MDR_RST_MAX_CLK_Bits  MAX_CLK_b;
  } ;
  //  CPU Control and PER Clock enable
  union {
    __IOM uint32_t        CPU_CLK;              /*!< (@ 0x00000008) CPU_CLK Register                                           */
    MDR_RST_CLK_CPU_Bits  CPU_CLK_b;
  } ;  
  union {
    __IOM uint32_t        PER0_CLK;             /*!< (@ 0x0000000C) Periph0 Clock Enable Register                              */
    MDR_RST_PER0_Bits     PER0_CLK_b;
  } ;  
  union {
    __IOM uint32_t        PER1_CLK;             /*!< (@ 0x00000010) Periph1 Clock Enable Register                              */
    MDR_RST_PER1_Bits     PER1_CLK_b;
  } ;  
  MDR_RST_CLK_CHECKER     CPU_CHKR;
  union {
    __IOM uint32_t        CPU_STAT;             /*!< (@ 0x00000020) Clock Status Register                                      */
    MDR_RST_CPU_STAT_Bits CPU_STAT_b;
  } ;
  //  LSI Control
  union {
    __IOM uint32_t        LSI_CLK;              /*!< (@ 0x00000024) Clock Contorl Register                                     */
    MDR_RST_CLK_LSIE_Bits LSI_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     LSI_CHKR; 
  union {
    __IOM uint32_t        LSI_STAT;             /*!< (@ 0x00000034) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits LSI_STAT_b;
  } ;
  //  HSI Control
  union {
    __IOM uint32_t        HSI_STAT;                    /*!< (@ 0x00000038) Clock Status Register                                      */
    MDR_RST_HSI_STAT_Bits HSI_STAT_b;
  } ;
  //  LSE Control
  union {
    __IOM uint32_t        LSE_CLK;                     /*!< (@ 0x0000003C) Clock Contorl Register                                     */
    MDR_RST_CLK_LSIE_Bits LSE_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     LSE_CHKR; 
  union {
    __IOM uint32_t        LSE_STAT;                    /*!< (@ 0x0000004C) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits LSE_STAT_b;
  } ;
  //  HSE0 Control
  union {
    __IOM uint32_t        HSE0_CLK;                    /*!< (@ 0x00000050) Clock Contorl Register                                     */    
    MDR_RST_HSE_CLK_Bits  HSE0_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     HSE0_CHKR; 
  union {
    __IOM uint32_t        HSE0_STAT;                   /*!< (@ 0x00000060) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits HSE0_STAT_b;
  } ;
  //  HSE1 Control
  union {
    __IOM uint32_t        HSE1_CLK;                    /*!< (@ 0x00000064) Clock Contorl Register                                     */
    MDR_RST_HSE_CLK_Bits  HSE1_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     HSE1_CHKR;
  union {
    __IOM uint32_t        HSE1_STAT;                   /*!< (@ 0x00000060) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits HSE1_STAT_b;
  } ;
  //  PLL0  
  union {
    __IOM uint32_t        PLL0_CLK;                    /*!< (@ 0x00000078) PLL0 Control                                               */
    MDR_RST_PLL_CLK_Bits  PLL0_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     PLL0_CHKR;
  union {
    __IOM uint32_t        PLL0_STAT;                   /*!< (@ 0x00000088) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits PLL0_STAT_b;
  } ;
  //  PLL1
  union {
    __IOM uint32_t        PLL1_CLK;                    /*!< (@ 0x0000008C) PLL0 Control                                               */
    MDR_RST_PLL_CLK_Bits  PLL1_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     PLL1_CHKR;  
  union {
    __IOM uint32_t        PLL1_STAT;                   /*!< (@ 0x0000009C) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits PLL1_STAT_b;
  } ;
  //  PLL2
  union {
    __IOM uint32_t        PLL2_CLK;                    /*!< (@ 0x0000008C) PLL0 Control                                               */
    MDR_RST_PLL_CLK_Bits  PLL2_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     PLL2_CHKR;  
  union {
    __IOM uint32_t        PLL2_STAT;                   /*!< (@ 0x0000009C) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits PLL2_STAT_b;
  } ;
  //  Reserved
  __IM  uint32_t          RESERVED[25];
  //  PERIPHERIAL Clock Control
  union {
    __IOM uint32_t        CAN1_CLK;                    /*!< (@ 0x00000118) Sync Clock Control                                         */
    MDR_RST_SYNC_CLK_Bits CAN1_CLK_b;
  } ;
  __IM  uint32_t          RESERVED1[5];  
  union {
    __IOM uint32_t        TIM1_CLK;                    /*!< (@ 0x00000130) Sync Clock Control                                         */
    MDR_RST_SYNC_CLK_Bits TIM1_CLK_b;
  } ;  
  union {
    __IOM uint32_t        TIM2_CLK;                    /*!< (@ 0x00000134) Sync Clock Control                                         */
    MDR_RST_SYNC_CLK_Bits TIM2_CLK_b;
  } ;  
  union {
    __IOM uint32_t        TIM3_CLK;                    /*!< (@ 0x00000138) Sync Clock Control                                         */
    MDR_RST_SYNC_CLK_Bits TIM3_CLK_b;
  } ;  
  union {
    __IOM uint32_t        TIM4_CLK;                    /*!< (@ 0x0000013C) Sync Clock Control                                         */
    MDR_RST_SYNC_CLK_Bits TIM4_CLK_b;
  } ;
  __IM  uint32_t          RESERVED2[12];
  union {
    __IOM uint32_t         ETH_CLK;                     /*!< (@ 0x00000170) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits ETH_CLK_b;
  } ;
  __IM  uint32_t          RESERVED3;  
  union {
    __IOM uint32_t        SPW1_CLK;                    /*!< (@ 0x00000178) Sync Clock Control                                         */
    MDR_RST_SYNC_CLK_Bits SPW1_CLK_b;
  } ;
  __IM  uint32_t          RESERVED4[3];  
  union {
    __IOM uint32_t         UART1_CLK;                   /*!< (@ 0x00000188) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits UART1_CLK_b;
  } ;  
  union {
    __IOM uint32_t         UART2_CLK;                   /*!< (@ 0x0000018C) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits UART2_CLK_b;
  } ;
  __IM  uint32_t          RESERVED5[4];  
  union {
    __IOM uint32_t         SSP1_CLK;                    /*!< (@ 0x000001A0) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits SSP1_CLK_b;
  } ;
  __IM  uint32_t          RESERVED6[6];  
  union {
    __IOM uint32_t         ADC1_CLK;                    /*!< (@ 0x000001BC) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits ADC1_CLK_b;
  } ;
  union {
    __IOM uint32_t         ADC2_CLK;                    /*!< (@ 0x000001C0) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits ADC2_CLK_b;
  } ;  
  union {
    __IOM uint32_t         DAC1_CLK;                    /*!< (@ 0x000001C4) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits DAC1_CLK_b;
  } ;  
  union {
    __IOM uint32_t         DAC2_CLK;                    /*!< (@ 0x000001C8) Async Clock Control                                       */
    MDR_RST_ASYNC_CLK_Bits DAC2_CLK_b;
  } ;  
  union {
    __IOM uint32_t         RTC_CLK;                     /*!< (@ 0x000001CC) Async Clock Control                                        */
    MDR_RST_ASYNC_CLK_Bits RTC_CLK_b;
  } ;
} MDR_RST_CLOCK_Type;                           /*!< Size = 464 (0x1d0)                                                        */


