StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE8/MDR_RST_VE8_defs.h
typedef struct {
  union {
    __IOM uint32_t        HSE_CLK;                    /*!< (@ 0x00000050) Clock Contorl Register                                     */    
    MDR_RST_HSE_CLK_Bits  HSE_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     HSE_CHKR; 
  union {
    __IOM uint32_t        HSE_STAT;                   /*!< (@ 0x00000060) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits HSE_STAT_b;
  } ;  
} MDR_RST_HSE_Type;


typedef struct {
  union {
    __IOM uint32_t        PLL_CLK;                    /*!< (@ 0x00000078) PLL0 Control                                               */
    MDR_RST_PLL_CLK_Bits  PLL_CLK_b;
  } ;
  MDR_RST_CLK_CHECKER     PLL_CHKR;
  union {
    __IOM uint32_t        PLL_STAT;                   /*!< (@ 0x00000088) Clock Status Register                                      */
    MDR_RST_CLK_STAT_Bits PLL_STAT_b;
  } ; 
} MDR_RST_PLL_Type;


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif
/* =========================================  End of section using anonymous unions  ========================================= */

#ifdef __cplusplus
}
#endif

#endif  //_MDR_RST_VE8_DEFS_H
